emacs/README.org
#+TITLE: Emacs configuration
#+PROPERTY: header-args:emacs-lisp :tangle .emacs.d/init.el :mkdirp yes

* Elpaca setup
 #+BEGIN_SRC emacs-lisp
   (setq package-enable-at-startup nil)
   (defvar elpaca-installer-version 0.3)
   (defvar elpaca-directory (expand-file-name "elpaca/" user-emacs-directory))
   (defvar elpaca-builds-directory (expand-file-name "builds/" elpaca-directory))
   (defvar elpaca-repos-directory (expand-file-name "repos/" elpaca-directory))
   (defvar elpaca-order '(elpaca :repo "https://github.com/progfolio/elpaca.git"
                                 :ref nil
                                 :files (:defaults (:exclude "extensions"))
                                 :build (:not elpaca--activate-package)))
   (let* ((repo  (expand-file-name "elpaca/" elpaca-repos-directory))
          (build (expand-file-name "elpaca/" elpaca-builds-directory))
          (order (cdr elpaca-order))
          (default-directory repo))
     (add-to-list 'load-path (if (file-exists-p build) build repo))
     (unless (file-exists-p repo)
       (make-directory repo t)
       (condition-case-unless-debug err
           (if-let ((buffer (pop-to-buffer-same-window "*elpaca-bootstrap*"))
                    ((zerop (call-process "git" nil buffer t "clone"
                                          (plist-get order :repo) repo)))
                    ((zerop (call-process "git" nil buffer t "checkout"
                                          (or (plist-get order :ref) "--"))))
                    (emacs (concat invocation-directory invocation-name))
                    ((zerop (call-process emacs nil buffer nil "-Q" "-L" "." "--batch"
                                          "--eval" "(byte-recompile-directory \".\" 0 'force)")))
                    ((require 'elpaca))
                    ((elpaca-generate-autoloads "elpaca" repo)))
               (kill-buffer buffer)
             (error "%s" (with-current-buffer buffer (buffer-string))))
         ((error) (warn "%s" err) (delete-directory repo 'recursive))))
     (unless (require 'elpaca-autoloads nil t)
       (require 'elpaca)
       (elpaca-generate-autoloads "elpaca" repo)
       (load "./elpaca-autoloads")))
   (add-hook 'after-init-hook #'elpaca-process-queues)
   (elpaca `(,@elpaca-order))
#+END_SRC

#+BEGIN_SRC emacs-lisp
  ;; Install use-package support
  (elpaca elpaca-use-package
          ;; Enable :elpaca use-package keyword.
          (elpaca-use-package-mode)
          ;; Assume :elpaca t unless otherwise specified.
          (setq elpaca-use-package-by-default t))

  ;; Block until current queue processed.
  (elpaca-wait)
  
  ;; (setq native-comp-deferred-compilation-deny-list nil)
#+END_SRC

* Defaults
** Sane 2022 file setup
#+BEGIN_SRC emacs-lisp
  (add-hook 'elpaca-after-init-hook
            #'(lambda ()
                (setq gc-cons-threshold (* 100 1000 1000))))
#+END_SRC

Warn when opening files bigger than 100MB
#+BEGIN_SRC emacs-lisp
  (setq large-file-warning-threshold 100000000)
#+END_SRC

Increase the amount of data which Emacs reads from a process
#+BEGIN_SRC emacs-lisp
(setq read-process-output-max (* 5 (* 1024 1024)))
(setq process-adaptive-read-buffering nil)
#+END_SRC

Good scrolling
#+begin_src emacs-lisp
  (pixel-scroll-precision-mode 1)
  (setq pixel-scroll-precision-use-momentum t)
#+end_src

** Less verbose prompt
#+BEGIN_SRC emacs-lisp
  (setq tab-always-indent t)
  (defalias 'yes-or-no-p 'y-or-n-p)
  (setq xref-prompt-for-identifier nil)
  (setq comint-prompt-read-only t)
#+END_SRC

** Better minibuffer completion keybind
#+begin_src emacs-lisp
  (define-key minibuffer-local-completion-map " " nil)
  (define-key minibuffer-local-must-match-map " " nil)
  (define-key minibuffer-local-completion-map "?" nil)
  (define-key minibuffer-local-must-match-map "?" nil)
#+end_src

** Avoid emacs littering
#+BEGIN_SRC emacs-lisp
  (setq backup-directory-alist `(("." . ,(expand-file-name "tmp/backups/" user-emacs-directory))))
  ;; auto-save-mode doesn't create the path automatically!
  (make-directory (expand-file-name "tmp/auto-saves/" user-emacs-directory) t)
  
  (setq auto-save-list-file-prefix (expand-file-name "tmp/auto-saves/sessions/" user-emacs-directory)
        auto-save-file-name-transforms `((".*" ,(expand-file-name "tmp/auto-saves/" user-emacs-directory) t)))
  (setq create-lockfiles nil)
  (setq projectile-known-projects-file (expand-file-name "tmp/projectile-bookmarks.eld" user-emacs-directory)
        lsp-session-file (expand-file-name "tmp/.lsp-session-v1" user-emacs-directory))
  
  (use-package no-littering)
#+END_SRC

** Buffer & frames
#+BEGIN_SRC emacs-lisp
  (setq global-auto-revert-non-file-buffers t)
  (global-auto-revert-mode 1)
  (require 'bind-key)
  (bind-key* "C-x k" #'kill-current-buffer)
  (bind-key* "C-x K" #'kill-buffer)
  (global-set-key (kbd "C-z") 'delete-frame)
  (delete-selection-mode 1)
#+END_SRC

** Bookmarks
This persists the bookmarks state after each bookmark modification.
It ensures that bookmarks are always up-to-date even when Emacs crashes.
As bookmarks are at the center of my workflow, this is a crucial option.

#+begin_src emacs-lisp
  (setq bookmark-save-flag 1)
#+end_src

** Indentation
#+BEGIN_SRC emacs-lisp
  (setq indent-tabs-mode nil)
  (setq indent-line-function 'insert-tab)
  (setq-default indent-tabs-mode nil)
  (setq-default tab-width 4)
  (setq c-basic-offset tab-width
        c-basic-offset tab-width
        c-basic-offset tab-width
        csharp-tree-sitter-indent-offset tab-width
        c-basic-offset tab-width
        c-basic-offset tab-width
        c-basic-offset tab-width
        js-indent-level tab-width
        js2-basic-offset tab-width
        js3-indent-level tab-width
        js-indent-level tab-width
        lua-indent-level tab-width
        c-basic-offset tab-width
        c-basic-offset tab-width
        perl-indent-level tab-width
        cperl-indent-level tab-width
        raku-indent-offset tab-width
        erlang-indent-level tab-width
        ada-indent tab-width
        sgml-basic-offset tab-width
        nxml-child-indent tab-width
        pascal-indent-level tab-width
        typescript-indent-level tab-width
        sh-basic-offset tab-width
        ruby-indent-level tab-width
        enh-ruby-indent-level tab-width
        crystal-indent-level tab-width
        css-indent-offset tab-width
        rust-indent-offset tab-width
        rustic-indent-offset tab-width
        scala-indent:step tab-width
        powershell-indent tab-width
        ess-indent-offset tab-width
        yaml-indent-offset tab-width
        hack-indent-offset tab-width
        standard-indent tab-width)
#+END_SRC

** Lines style
#+begin_src emacs-lisp
  (setq display-line-numbers-type 'relative)
  (global-display-line-numbers-mode 1)
  (global-hl-line-mode 1)
#+end_src

** Log level
#+BEGIN_SRC emacs-lisp
  (setq warning-minimum-level :error)
#+END_SRC

** Repeat
#+begin_src emacs-lisp
  (repeat-mode 1)
#+end_src

** Useful for french characters ?
#+begin_src emacs-lisp
  (require 'iso-transl)
#+end_src

** Lighter interface
#+BEGIN_SRC emacs-lisp
  (scroll-bar-mode 1)
  (tool-bar-mode -1)
  (tooltip-mode -1)
  (menu-bar-mode -1)
  (setq window-divider-default-right-width 22
        window-divider-default-bottom-width 22)
  (setq-default header-line-format "")

  (window-divider-mode 1)
  (defun theme/minibuffer-echo-area ())

  (defun window/set-header-gap (window)
    (with-selected-window window
      (if (window-in-direction 'above)
          (set-window-parameter window 'header-line-format "")
        (set-window-parameter window 'header-line-format 'none))))

  (defun window/set-current-header-gap ()
    (interactive)
    (window/set-header-gap (selected-window)))

  (defun window/set-all-header-gaps ()
    (interactive)
    (theme/minibuffer-echo-area)
    (dolist (frame (frame-list))
      (with-selected-frame frame
        (dolist (window (window-list))
          (window/set-header-gap window)))))


  (add-hook 'window-configuration-change-hook #'window/set-all-header-gaps)
#+END_SRC

** Fonts setting
#+BEGIN_SRC emacs-lisp
  (setq-default fill-column 100)

  (set-face-attribute 'default nil :font "SauceCodePro NF-11")

  ;; Set the fixed pitch face
  (set-face-attribute 'fixed-pitch nil :font "SauceCodePro NF-11")

  ;; Set the variable pitch face
  (set-face-attribute 'variable-pitch nil :font "Cantarell-11" :weight 'regular)

  (defun disable-mixed-pitch ()
    (interactive)
    (mixed-pitch-mode -1))

  (use-package mixed-pitch
    :hook
    (org-mode . mixed-pitch-mode))
#+END_SRC

* Dracula theme
#+BEGIN_SRC emacs-lisp
  (load-file "~/.emacs.d/custom_packages/dracula-theme.el")
  (load-theme 'dracula t)

  (fringe-mode '(24 . 8))

  (defun theme/minibuffer-echo-area ()
    (interactive)
    (dolist (buf '( " *Minibuf-1*"))
      (with-current-buffer (get-buffer-create buf)
        (face-remap-add-relative 'default :background "#44475a")
        (face-remap-add-relative 'fringe :background "#44475a")))
    (dolist (buf '(" *Minibuf-0*" " *Echo Area 0*" " *Echo Area 1*"))
      (with-current-buffer (get-buffer-create buf)
        (when (= (buffer-size) 0)
          (insert " "))
        ;; Don't allow users to kill these buffers, as it destroys the hack
        (add-hook 'kill-buffer-query-functions #'ignore nil 'local)
        (set-window-scroll-bars (minibuffer-window) nil nil)
        (face-remap-add-relative 'default :background "#282a36")
        (face-remap-add-relative 'fringe :background "#282a36"))))
#+END_SRC

* All the icons
#+BEGIN_SRC emacs-lisp
  (use-package all-the-icons
    :if (display-graphic-p))
#+END_SRC

* COMMENT Doom mode-line
#+BEGIN_SRC emacs-lisp
  (use-package doom-modeline
    :config
    (defun my-doom-modeline--font-height ()
      "Calculate the actual char height of the mode-line."
      (- (frame-char-height) 10))
    (advice-add #'doom-modeline--font-height :override #'my-doom-modeline--font-height)
    (setq doom-modeline-battery nil
          doom-modeline-time nil
          doom-modeline-workspace-name nil
          doom-modeline-bar-width 1
          doom-modeline-window-width-limit nil
          doom-modeline-height 22
          doom-modeline-major-mode-icon nil
          doom-modeline-icon t
          doom-modeline-unicode-fallback nil)

    (setq all-the-icons-scale-factor 0.95)

    (remove-hook 'display-time-mode-hook #'doom-modeline-override-time-modeline)
    (remove-hook 'doom-modeline-mode-hook #'doom-modeline-override-time-modeline)

    (defun utils/s-truncate (len s &optional ellipsis)
      "Like `s-truncate' but
  - return S when LEN is nil
  - return empty string when len is shorter than ELLIPSIS"
      (declare (pure t) (side-effect-free t))
      (let ((ellipsis (or ellipsis "...")))
        (cond
         ((null len) s)
         ((< len (length ellipsis)) "")
         (t (s-truncate len s ellipsis)))))

    (defun doom-modeline/segment--buffer-info (orig-fn &rest args)
      "`doom-modeline-segment--buffer-info' but truncate."
      (utils/s-truncate (max 10 (- (window-width) 45))
       (format-mode-line (apply orig-fn args))
       "..."))
  
    (advice-add #'doom-modeline-segment--buffer-info :around #'doom-modeline/segment--buffer-info)

    (doom-modeline-mode 1))
#+END_SRC

* Search & completion
** Built-in setup
#+begin_src emacs-lisp
    (setq tab-always-indent t
          completions-format 'one-column
          completions-header-format nil
          completion-show-help t
          completion-show-inline-help t
          completions-max-height nil
          completion-auto-select nil)

    (setq-default isearch-lazy-count t
                  isearch-allow-motion t)
  #+end_src

** Vertico
#+BEGIN_SRC emacs-lisp
  (use-package vertico
    :config
    (load-file "~/.emacs.d/elpaca/repos/vertico/extensions/vertico-multiform.el")
    (setq vertico-cycle t)
    (vertico-mode))

  (use-package vertico-posframe
    :config
    (defun vertico/reset-position ()
      (interactive)
      (setq vertico/position nil))
    (vertico/reset-position)
    (advice-add 'vertico-posframe--minibuffer-exit-hook :after #'vertico/reset-position)

    (defun vertico/posframe-poshandler-point (info)
      (let ((position (if vertico/position vertico/position (posframe-poshandler-point-1 info))))
        (setq vertico/position position)
        vertico/position))

    (setq vertico-posframe-poshandler 'vertico/posframe-poshandler-point
          vertico-posframe-border-width 8
          vertico-posframe-min-width 120)

    (vertico-posframe-mode 1))
#+END_SRC

** Company
#+BEGIN_SRC emacs-lisp
  (use-package company
    :hook (emacs-lisp-mode . (lambda () (setq-local company-backends '(company-elisp))))
    :bind (:map company-active-map
                ("<tab>" . company-complete-selection))
    (:map company-active-map
          ("<return>" . nil)
          ("RET" . nil)
          ("M-<return>" . company-complete-selection))
    :config
    (setq company-require-match nil
          company-minimum-prefix-length 1
          company-idle-delay 0.0
          company-selection-wrap-around t
          company-tooltip-limit 15)
    (global-company-mode))

  (use-package company-box
    :hook (company-mode . company-box-mode)
    :config
    (setq
     company-box-scrollbar nil
     company-box-doc-enable nil))
#+END_SRC

** Embark
#+BEGIN_SRC emacs-lisp
  (use-package embark
    :bind (
           :map minibuffer-local-map
           ("C-c e" . embark-act)))
#+END_SRC

