emacs/README.org
** Lsp mode (or emacs as an IDE)
 
#+BEGIN_SRC emacs-lisp
  (use-package lsp-mode
    :defer t
    :init
    ;; set prefix for lsp-command-keymap (few alternatives - "C-l", "C-c l")
    (setq lsp-keymap-prefix "C-c l")
    :custom
    (lsp-clients-typescript-server-args '("--stdio"))
    :bind (
           :map lsp-mode-map
           ("C-h ." . lsp-describe-thing-at-point)
           ("C-." . lsp-execute-code-action)
           ("M-." . lsp-find-definition))
    :hook (;; replace XXX-mode with concrete major-mode(e. g. python-mode)
           (js-mode . (lambda () 
                        (lsp)))
           (typescript-ts-mode . (lambda () 
                                   (lsp)))
           (lsp-mode . (lambda ()
                         (defun lsp-modeline--code-actions-icon (face)
                           "Build the icon for modeline code actions using FACE."
                           (propertize tab/space-between-status-element 'face face))
                         (make-local-variable 'completion-at-point-functions)))
           ;; if you want which-key integration
           (lsp-mode . lsp-enable-which-key-integration))
    :commands lsp
    :config
    (with-eval-after-load 'js
      (define-key js-mode-map (kbd "M-.") nil)
      )
    (setq
     lsp-log-io nil
     lsp-enable-symbol-highlighting nil
     lsp-eldoc-render-all t
     lsp-auto-guess-root t
     lsp-log-io nil
     lsp-restart 'auto-restart
     lsp-enable-on-type-formatting nil
     lsp-eslint-auto-fix-on-save nil
     lsp-signature-auto-activate t
     lsp-signature-render-documentation t
     lsp-signature-function 'lsp/signature-posframe
     lsp-headerline-breadcrumb-enable nil
     lsp-semantic-tokens-enable nil
     lsp-enable-folding nil
     lsp-enable-snippet t
     lsp-idle-delay 0.0)

    (defvar lsp/signature-posframe-params
      (list :poshandler #'posframe/poshandler-window-top-or-bottom-right-corner
            :height 10
            :width 60
            :border-width 8
            :min-width 60
            :parent-frame nil)
      "Params for signature and `posframe-show'.")

    (defun lsp/signature-posframe (str)
      "Use posframe to show the STR signatureHelp string."
      (if str
          (apply #'posframe-show
                 (with-current-buffer (get-buffer-create " *lsp-signature*")
                   (erase-buffer)
                   (insert str)
                   (visual-line-mode 1)
                   (lsp--setup-page-break-mode-if-present)
                   (current-buffer))
                 (append
                  lsp/signature-posframe-params
                  (list :position (point)
                        :background-color (face-attribute 'lsp-signature-posframe :background nil t)
                        :foreground-color (face-attribute 'lsp-signature-posframe :foreground nil t)
                        :border-color (face-attribute 'lsp-signature-posframe :background nil t))))
        (posframe-hide " *lsp-signature*")))

    (set-face-attribute 'lsp-signature-posframe nil :inherit 'hl-line))
 #+END_SRC

*** Natural languages server
This requires a Java runtime environment.
#+BEGIN_SRC emacs-lisp
  (defun disable-lsp-ltex ()
    (interactive)
    (lsp-workspace-shutdown 'lsp--cur-workspace))

  (use-package lsp-ltex
    :config
    (setq lsp-ltex-completion-enabled t)
    :hook
    (text-mode . (lambda ()
                   (require 'lsp-ltex)
                   (lsp)))
    (yaml-mode . disable-lsp-ltex))
#+END_SRC

*** Dap mode
#+BEGIN_SRC emacs-lisp
  (use-package dap-mode
    :config
    (require 'dap-node)
    (dap-node-setup))
#+END_SRC

** Adoc
#+BEGIN_SRC emacs-lisp
  (use-package adoc-mode
    :config
    (add-to-list 'auto-mode-alist '("\\.adoc\\'" . adoc-mode)))
#+END_SRC

** Restclient
#+BEGIN_SRC emacs-lisp
  (use-package restclient
    :config
    (add-to-list 'auto-mode-alist '("\\.http\\'" . restclient-mode)))

  (use-package ob-restclient
    :after org
    :config
    (org-babel-do-load-languages
     'org-babel-load-languages
     '((restclient . t))))
#+END_SRC

** Kubel
#+BEGIN_SRC emacs-lisp
  (if (eq (shell-command "kubectl --help") 0 )
      (use-package kubel))
#+END_SRC

** Docker
#+BEGIN_SRC emacs-lisp
  (use-package dockerfile-mode)

  (use-package docker-compose-mode)

  (use-package docker
    :config
    (define-derived-mode docker-container-mode tabulated-list-mode "Containers Menu"
      "Major mode for handling a list of docker containers."
      (setq tabulated-list-format [("Id" 5 t)("Image" 5 t)("Command" 10 t)("Created" 10 t)("Status" 10 t)("Ports" 35 t)("Names" 30 t)])
      (setq tabulated-list-padding 2)
      (setq tabulated-list-sort-key docker-container-default-sort-key)
      (add-hook 'tabulated-list-revert-hook 'docker-container-refresh nil t)
      (tabulated-list-init-header)
      (tablist-minor-mode))

    (setq docker-container-shell-file-name "/bin/sh")

    (add-hook 'docker-container-mode 'docker/set-format))
#+END_SRC

** Csv
#+BEGIN_SRC emacs-lisp
  (use-package csv-mode
    :config
    (add-hook 'csv-mode-hook 'csv-guess-set-separator)
    (setq csv-separators '("," ";" ":")))
#+END_SRC

** devdocs
#+begin_src emacs-lisp
  (use-package devdocs
    :config
    (global-set-key (kbd "C-h D") #'devdocs-lookup)
    (add-hook 'js-mode-hook
          (lambda () (setq-local devdocs-current-docs '("node~16_lts" "jsdoc" "javascript")))))
#+end_src

** ejc-sql
#+begin_src emacs-lisp
  (use-package ejc-sql
    :config
    (setq
     ejc-result-table-impl 'orgtbl-mode
     ejc-set-column-width-limit nil
     ejc-set-use-unicode t)
    (add-hook 'sql-mode-hook
              (lambda ()
                (ejc-sql-mode t)))
    (add-hook 'ejc-sql-minor-mode-hook
              (lambda ()
                (ejc-eldoc-setup)))
    (require 'ejc-company)
    (push 'ejc-company-backend company-backends)
    (add-hook 'ejc-sql-minor-mode-hook
              (lambda ()
                (company-mode t))))
#+end_src

* Shells & terminals
** xterm color
#+begin_src emacs-lisp
  (use-package xterm-color
    :config
    (setq comint-output-filter-functions
          (remove 'ansi-color-process-output comint-output-filter-functions))

    (add-hook 'shell-mode-hook
              (lambda ()
                ;; Disable font-locking in this buffer to improve performance
                (font-lock-mode -1)
                ;; Prevent font-locking from being re-enabled in this buffer
                (make-local-variable 'font-lock-function)
                (setq font-lock-function (lambda (_) nil))
                (add-hook 'comint-preoutput-filter-functions 'xterm-color-filter nil t)))

    (add-hook 'eat-mode-hook
              (lambda ()
                ;; Disable font-locking in this buffer to improve performance
                (font-lock-mode -1)
                ;; Prevent font-locking from being re-enabled in this buffer
                (make-local-variable 'font-lock-function)
                (setq font-lock-function (lambda (_) nil))
                (add-hook 'comint-preoutput-filter-functions 'xterm-color-filter nil t))))

  ;; (require 'eshell) ; or use with-eval-after-load

  ;;   (add-hook 'eshell-before-prompt-hook
  ;;             (lambda ()
  ;;               (setq xterm-color-preserve-properties t)))

  ;;   (add-to-list 'eshell-preoutput-filter-functions 'xterm-color-filter)
  ;;   (setq eshell-output-filter-functions (remove 'eshell-handle-ansi-color eshell-output-filter-functions))

  ;;   (setenv "TERM" "xterm-256color")

  ;;   (setq compilation-environment '("TERM=xterm-256color"))

  ;;   (defun my/advice-compilation-filter (f proc string)
  ;;     (funcall f proc (xterm-color-filter string)))

  ;;   (advice-add 'compilation-filter :around #'my/advice-compilation-filter))
#+end_src

** Eshell
#+begin_src emacs-lisp
  (custom-set-faces
   `(ansi-color-black ((t (:foreground "#282a36"))))
   `(ansi-color-red ((t (:foreground "#ff5555"))))
   `(ansi-color-green ((t (:foreground "#50fa7b"))))
   `(ansi-color-yellow ((t (:foreground "#f1fa8c"))))
   `(ansi-color-blue ((t (:foreground "#bd93f9"))))
   `(ansi-color-magenta ((t (:foreground "#ff79c6"))))
   `(ansi-color-cyan ((t (:foreground "#8be9fd"))))
   `(ansi-color-gray ((t (:foreground "#f8f8f2")))))

  (setq eshell-banner-message "")

  (defun eshell/hook ()
    (define-key eshell-mode-map (kbd "M-m") #'eshell-bol)
    (require 'eshell)
    (require 'em-smart)
    (setq 
     eshell-where-to-jump 'begin
     eshell-review-quick-commands nil
     eshell-smart-space-goes-to-end t
     eshell-prompt-function
     (lambda ()
       (concat (format-time-string " %Y-%m-%d %H:%M" (current-time))
               (if (= (user-uid) 0) " # " " $ ")))
     eshell-highlight-prompt t)
    (set-face-attribute 'eshell-prompt nil :weight 'ultra-bold :inherit 'minibuffer-prompt))
  (add-hook 'eshell-mode-hook #'eshell/hook)

  (use-package eshell
    :elpaca nil
    :bind (:map eshell-mode-map
                ("<tab>" . company-complete)))
#+end_src

*** Eat
#+begin_src emacs-lisp
  (use-package eat
    :config
    ;; (setq eat-term-terminfo-directory (concat (getenv "HOME") "/.emacs.d/straight/build/eat/terminfo"))
    (add-hook 'eshell-load-hook #'eat-eshell-mode)
    (add-hook 'eshell-load-hook #'eat-eshell-visual-command-mode))
#+end_src

*** Aliases
#+begin_src emacs-lisp
  (defun eshell/emacs (file)
    (find-file file))
#+end_src

** Better term
#+begin_src emacs-lisp
  (use-package multi-term
    :bind (
           :map term-mode-map
           ("s-I" . term-char-mode))
    :config
    (defun term-send-tab ()
      (interactive)
      (term-send-raw-string "\t"))

    (setq multi-term-program "bash")

    (add-to-list 'term-bind-key-alist '("<backtab>" . term-send-up))
    (add-to-list 'term-bind-key-alist '("TAB" . term-send-tab))
    (add-to-list 'term-bind-key-alist '("s-i" . term-line-mode)))
#+end_src

* Dired
#+BEGIN_SRC emacs-lisp
  (defun dired-open-file ()
    "In dired, open the file named on this line."
    (interactive)
    (let* ((file (dired-get-filename nil t)))
      (message "Opening %s..." file)
      (call-process "xdg-open" nil 0 nil file)
      (message "Opening %s done" file)))
#+END_SRC

#+BEGIN_SRC emacs-lisp
  (defun dired-open-home-dir ()
    "Open the home directory in dired"
    (interactive)
    (dired "~"))
#+END_SRC

#+BEGIN_SRC emacs-lisp
  (defun dired-open-current-dir ()
    "Open the current directory in dired"
    (interactive)
    (dired "."))
#+END_SRC

#+BEGIN_SRC emacs-lisp
  (use-package dired
    :elpaca nil
    :bind (
           :map dired-mode-map
           ("C-." . dired-hide-dotfiles-mode)
           ("<C-return>" . dired-open-file)
           ("M-p" . dired-up-directory)
           ("M-n" . dired-find-file)
           ("s-i" . dired-toggle-read-only))
    :hook
    (dired-mode . dired-hide-details-mode)
    :config
    (setq ls-lisp-use-insert-directory-program nil)
    (require 'ls-lisp)
    (setq ls-lisp-dirs-first t)
    (setq wdired-allow-to-change-permissions t)
    (add-hook 'wdired-mode-hook
      (lambda ()
        (define-key wdired-mode-map (kbd "s-I") 'wdired-abort-changes))))

  (use-package dired-subtree
    :bind (
           :map dired-mode-map
           ("C-<tab>" . dired-subtree-cycle)
           ("<tab>" . dired-subtree-toggle)
           ("<backtab>" . dired-subtree-remove)))
#+END_SRC

#+BEGIN_SRC emacs-lisp
  (use-package dired-hide-dotfiles
    :hook
    (dired-mode . dired-hide-dotfiles-mode))
#+END_SRC

* Internet
** HTML viewer
#+BEGIN_SRC emacs-lisp
  (use-package shr
    :elpaca nil
    :config
    (setq shr-use-fonts nil)
    (setq shr-use-colors nil)
    (setq shr-max-image-proportion 1)
    (setq shr-width nil)
    (setq shr-folding-mode t))
#+END_SRC

#+BEGIN_SRC emacs-lisp
  ;; Used to highlight code
  (use-package shr-tag-pre-highlight
    :after shr
      :config
      (add-to-list 'shr-external-rendering-functions
                   '(pre . shr-tag-pre-highlight))
      (when (version< emacs-version "26")
        (with-eval-after-load 'eww
          (advice-add 'eww-display-html :around
                      'eww-display-html--override-shr-external-rendering-functions))))

  (use-package shrface
      :config
      (shrface-basic)
      (shrface-trial)
      (shrface-default-keybindings)
      (setq shrface-href-versatile t)

      ;; Code highlighting
      (require 'shr-tag-pre-highlight)
      (add-to-list 'shr-external-rendering-functions '(pre . shrface-shr-tag-pre-highlight))
      (defun shrface-shr-tag-pre-highlight (pre)
        "Highlighting code in PRE."
        (let* ((shr-folding-mode 'none)
               (shr-current-font 'default)
               (code (with-temp-buffer
                       (shr-generic pre)
                       (setq-local fill-column 120)
                       (indent-rigidly (point-min) (point-max) 2)
                       (if (eq "" (dom-texts pre))
                           nil
                         (progn
                           (setq-local fill-column shrface-paragraph-fill-column)
                           (indent-rigidly (point-min) (point-max) shrface-paragraph-indentation)))
                       (buffer-string)))
               (lang (or (shr-tag-pre-highlight-guess-language-attr pre)
                         (let ((sym (language-detection-string code)))
                           (and sym (symbol-name sym)))))
               (mode (and lang
                          (shr-tag-pre-highlight--get-lang-mode lang))))
          (shr-ensure-newline)
          (insert (propertize (concat "#+BEGIN_SRC " lang) 'face 'org-block-begin-line))
          (shr-ensure-newline)
          (setq start (point))
          (insert
           (or (and (fboundp mode)
                    (with-demoted-errors "Error while fontifying: %S"
                      (shrface-tag-pre-highlight-fontify code mode)
                      ))
               code))
          (shr-ensure-newline)
          (setq end (point))
          (insert (propertize "#+END_SRC" 'face 'org-block-end-line ))
          (shr-ensure-newline)
          (insert "\n"))))
#+END_SRC

